 #include <iostream>

int main()
{
  







}











//
//1.  Откройте файл “f1.txt”, считайте данные из файла(целое число), 
// возведите считанное значение во 2 степень и выведите на экран.
// 
//2.  В файл записаны целые числа, по одному числу в строке.
// Считайте из файла “f1.txt” построчно все данные.Выведите на экран сумму считанных чисел.
// 
//3.  В файл записаны целые числа, по одному числу в строке.
// Считайте из файла “f1.txt” построчно все данные.
// Удвойте значение каждого считанного значения и запишите в файл “f2.txt”.
// 
//4.  В файле “f1.txt” записан текст.
// Считать текст, определить сколько раз в считанном тексте встречается символ “s”, вывести значение на экран.
// 
//5.  Дан файл “f.txt”.Создать два файла “f1.txt” и “f2.txt”, 
// записав в первый из них все четные числа, а во второй – все нечетные(каждое число в отдельной строке).
// 
//6.  В файле “f.txt” записан текст.
// Перезаписать текст в файл “f1.txt”разделяя на строки, переходить на новую строку после каждого символа “s”.
//

